function [PhaseP] = EigenVector(H)
%EIGENVECTOR 通过特征向量法求出控制点声压向量的相位
%   此处显示详细说明
% *************************************************************************
% *************************************************************************
% *  时间：2006年6月14日                                                  *
% *  函数目的：通过特征向量法求出控制点声压向量的相位                     *
% *  函数输入：阵元H矩阵                                                  * 
% *  函数输出：控制点声压向量的相位PhaseP                                 *
% *************************************************************************
% *************************************************************************

HTran = H';
[V,D] = eig(H*HTran);
[entry,pos] = max(abs(D));
[e,p] = max(entry);
PhaseP = angle(V(:,p));

end

